{
  "personalInformation": {
    "profilePictureSrc": "assets/img/profile-picture.jpeg",
    "name": "Matheus Jatczak Bertazzo",
    "nationality": "Brazilian",
    "email": "matheus@matheusbertazzo.com",
    "linkedIn": "https://www.linkedin.com/in/matheus-bertazzo",
    "github": "https://github.com/matheusbertazzo",
    "dateOfBirth": "1994-10-05",
    "biography": "  I'm a tech guy who really enjoys what I do for a living, here you'll find a little bit more about myself as well as the projects I worked on, personal interests, my professional experiences, ideas I have in mind (maybe I'll start a blog someday... Wouldn't count on that though) and my contact information."
  },
  "education":[
    {
      "name": "Universidade Federal do Paraná (UFPR)",
      "description": "Degree in \"Technology in System Analysis and Development\", Information Technology",
      "startDate":"2012-01-01",
      "endDate": "2015-01-01",
      "imgSrc": "/assets/img/education/logos/ufpr.svg"
    },
    {
      "name": "Faculdades Opet",
      "description": "IT Technician degree, Information Technology",
      "startDate":"2009-01-01",
      "endDate": "2011-01-01",
      "imgSrc": "/assets/img/education/logos/opet.png"
    }
  ],
  "personalInterests": [
    "Podcasts",
    "Coding",
    "Cyber Security",
    "Beer",
    "Books",
    "Cycling",
    "Video games",
    "Board games",
    "Card games",
    "Honestly, all kinds of games..."
  ],
  "technicalKnowledge": [
    {
      "title": ".NET & .NET Core",
      "description": [        
        "5+ years of development experience",
        "Yes, I also know VB.NET and ASP.NET...",
        "No, I wont take any VB.NET or ASP.NET opportunities"
      ],
      "emblemSrc": "assets/img/emblems/csharp.svg"
    },
    {
      "title": "HTML5, CSS3, JS...",
      "description": [
        "Bootstrap & Material design",
        "I love Angular and have been using it since 2014. (This very website is coded in Angular 🙂)",
        "I know a little bit of React, NodeJS, VueJS as well",
        "Yes, I also know SCSS, SASS, LESS, TypeScript and all the \"advanced\" stuff"
      ],
      "emblemSrc": "assets/img/emblems/html5.svg"
    },
    {
      "title": "Java",
      "description": [
        "Java is my go-to language for personal projects and quick PoC's",
        "7+ years of Spring boot development experience",
        "About 2 years of JSP/JSF development experience"
      ],
      "emblemSrc": "assets/img/emblems/java.png"
    },
    {
      "title": "Containers & Orchestration",
      "description": [
        "6+ years of Docker & Kubernetes experience",
        "Worked 4 years frequently using RedHat's Openshift Container Platform",
        "Good experience and a big fan of containerizing applications"
      ],
      "emblemSrc": "assets/img/emblems/containers.png"
    },
    {
      "title": "Database Stuff...",
      "description": [
        "SQL Server, Oracle, PostgreSQL, MySQL",
        "Stored procedures, functions, indexes, etc...",
        "Non-relational DB's: MongoDB, DocumentDB & Cosmos DB"
      ],
      "emblemSrc": "assets/img/emblems/db.png"
    },
    {
      "title": "Cloud Stuff",
      "description": [
        "Azure: Azure functions, VM's, Web applications, APIM, ARM templates, etc..",
        "Google Cloud Platform: I'm a certified <a target=\"_blank\" href=\"https://googlecloudcertified.credential.net/profile/df5cd1195ea76947535ef27dfc2508cc0477ed9a\">GCP Associate Cloud Engineer</a>",
        "AWS: About 3 years of constant usage of AWS cloud services"
      ],
      "emblemSrc": "assets/img/emblems/cloud.png"
    },
    {
      "title": "Agile software development",
      "description": [
        "Real agile experience, not the average \"We use scrum and a kanban board so we must be a super agile company\" experience people usually tend to believe in",
        "Scrum, Kanban, extreme programing (XP)",
        "Big fan of pair programming!",
        "It's past 2009, agile methodologies have been around for a while, if you don't use them correctly please don't contact me (or do, if you want to change 😉)"
      ],
      "emblemSrc": "assets/img/emblems/agile.png"
    },
    {
      "title": "Clean code & Best Practices",
      "description": [
        "Yes, I read a couple of books from Martin Fowler, Kent Beck, Robert C. Martin, Michael Feathers, etc...",
        "Test Driven Development (TDD) & Automated tests EVERYWHERE",
        "Domain Driven Design (DDD)",
        "SOLID, YAGNI, DRY, KISS...",
        "CI/CD and DevOps mindset"
      ],
      "emblemSrc": "assets/img/emblems/cleancode.png"
    }
  ],
  "careerInformation": [
    {
      "logoSrc": "assets/img/career/logos/adapar.png",
      "company": "ADAPAR",
      "startDate": "2013-02-01",
      "endDate": "2014-02-01",
      "iconSrc": "assets/img/career/icons/barn.png",
      "about": "ADAPAR (Agência de Defesa Agropecuária do Paraná) is the state entity responsible for the evaluation of documents and the agronomic efficiency regarding the authorization of commerce and use of agrotoxics in the state of Paraná",
      "positions": [
        {
          "title": "Intern (Software development)",
          "startDate": "2013-02-01",
          "endDate": "2014-02-01",
          "description": "System analysis and programming. Performed activities such as Web development using Object-Oriented PHP, Software documentation and diagramming using UML 2.0."
        },
        {
          "title": "Intern (Tech support)",
          "startDate": "2013-02-01",
          "endDate": "2014-02-01",
          "description": "Provided technical support for the 399 different ADAPAR units across the Paraná state. That involved troubleshooting/fixing hardware and software issues as well as sending/receiving computer parts across the different ADAPAR units and assisting on the purchasing of hardware equipment."
        }
      ],
      "projects": [
        {
          "title": "Asset management system",
          "description": "Created an application, using PHP and Microsoft SQL Server, to manage the company assets. That included the details about the asset, knowing who was the person responsible for that asset as well as it's current location (between multiple cities across the state) and also printing identification tags for those assets. This project was a one-man-project and included not only developing the system but also migrating asset data from different legacy systems, printing identification tags and, later, tagging the equipments."
        }
      ],
      "technologies": [
        "/assets/img/emblems/php.png",
        "/assets/img/emblems/sql-server.png"      
      ]
    },
    {
      "logoSrc": "assets/img/career/logos/logo-tce-pr.png",        
      "company": "TCE-PR",
      "startDate": "2014-02-01",
      "endDate": "2016-05-01",
      "iconSrc": "assets/img/career/icons/auction.png",
      "about": "TCE-PR (Tribunal de Contas do Estado do Paraná) is the state entity responsible for the audit of the use of all the state budget and also controling all volume of public money invested by Paraná's goverment (and all 399 city halls) and reporting the results of such investments for the population (making sure the money was well spent and assuring the quality of the services provided by the Paraná state).",
      "positions": [
        {
          "title": "Intern (Software development)",
          "startDate": "2014-02-01",
          "endDate": "2015-02-01",
          "description": "Software development for both, existing and new, internal systems using .NET (ASP, VB, C#, Entity Framework, MS Report Server and other Microsoft technologies). Also worked on system analysis by doing software documentation and diagramming using UML 2.0 as well as assisting senior system analysts on requirements specification."
        },
        {
          "title": "Full Stack .NET software developer (Contractor)",
          "startDate": "2015-02-01",
          "endDate": "2016-05-01",
          "description": "Was hired as a contractor (by eWave do Brasil) to be deployed on TCE-PR as Software developer. During this period, worked on software development for both, existing and new, internal systems that used a very diverse set of technologies, here's some of them: ASP.NET, .NET MVC, .NET Web API, Entity Framework, SQL Server, Microsoft Report Server, HTML5, CSS3, Bootstrap, JQuery and AngularJS."
        }
      ],
      "projects": [
        {
          "title": "Sistema de Obras Publicas do Paraná (SIOP)",
          "description": "Participated in the design and development of the SIOP application. This applications objective was to provide the population with information regarding the state's budget that is spent on the construction of public structures (streets, reneweals and construction of public buildings, statues, parks, etc...). The information provided is done through an interactive Parana's map with the assistance of a user friendly interface. This project was developed/designed by a team of 3 developers and is still maintained by TCEPR to this day. Since the application is public, you can access it on this link: <a href=\"https://servicos.tce.pr.gov.br/TCEPR/Tribunal/Relacon/Mapa/MapaObras\" target=\"_blank\">https://servicos.tce.pr.gov.br/TCEPR/Tribunal/Relacon/Mapa/MapaObras</a>"
        }
      ],
      "technologies": [
        "/assets/img/emblems/csharp.svg",
        "/assets/img/emblems/html5.png",
        "/assets/img/emblems/sql-server.png",
        "/assets/img/emblems/mvc.png",
        "/assets/img/emblems/bootstrap.png",
        "/assets/img/emblems/angular.svg"
      ]
    },
    {
      "logoSrc": "assets/img/career/logos/exxonmobil.png",        
      "company": "ExxonMobil",
      "startDate": "2016-05-11",
      "endDate": "2020-07-01",
      "iconSrc": "assets/img/career/icons/oil-pump.png",
      "about": "Exxon Mobil Corporation, stylized as ExxonMobil, is an American multinational oil and gas corporation headquartered in Irving, Texas. It is the largest direct descendant of John D. Rockefeller's Standard Oil, and was formed on November 30, 1999 by the merger of Exxon (formerly the Standard Oil Company of New Jersey) and Mobil (formerly the Standard Oil Company of New York). ExxonMobil's primary brands are Exxon, Mobil, Esso, and ExxonMobil Chemical.",
      "positions": [
        {
          "title": "Full Stack software developer",
          "startDate": "2016-05-11",
          "endDate": "2017-08-11",
          "description": "System analysis and full stack software development in multiple international projects (based in US, Canada, Budapest, India, Bangkok, among many other locations). During this period, most of the development done was towards the maintainance of existing internal applications. Among many other technologies involved on my day-to-day activities, it's worth mention the following: C# (MVC, Razor, .NET Core, IIS), SQL Server, AngularJS and NodeJS."
        },
        {
          "title": "Tech lead",
          "startDate": "2017-08-11",
          "endDate": "2020-07-01",
          "description": "Assumed the role of Tech lead on many different projects, with different team sizes (6 to 17 people) and stakeholders based on different locations (mainly in US, Budapest, India and Bangkok). Was responsible for designing and developing applications, guiding the technical team towards the agreed objectives, creating technical roadmaps that demonstrated what was envisioned for the future of the product as well as assuring quality through clean, maintainable and scalable code by applying coding best practices (such as SOLID, TDD, DDD, CI/CD and a DevOps mindset). Was also responsible for interacting with internal ExxonMobil customers and managing software development vendors based in India/Budapest. Among many other technologies involved in my daily activities, it's worth to mention: Java (Spring, Spring Boot), C# (MVC, Razor, .NET Core, IIS), Angular (Angular 2+, Jasmine, Karma, Protractor), NodeJS, Docker, Kubernetes, Jenkins, RedHat Openshift and Azure."
          }
      ],
      "projects": [
        {
          "title": "FindMe",
          "description": "Worked as the Tech lead/Lead developer and subject matter expert (SME) of the \"FindMe\" project. The project consisted in gathering network information from each office it was implemented and, based on that, automatically plot in an interactive map the information about where each person was seating. To this day, FindMe is fully implemented and widely used in the following ExxonMobil offices: Curitiba (Brazil), Buenos Aires (Argentina), Houston (US), Singapore (Malaysia), Kuala Lumpur (Malaysia) and Melbourne (Australia)."
        },
        {
          "title": "Summer (chatbot)",
          "description": "Worked as a Tech lead/Lead developer and, later, as a technical advisor during implementation of a chatbot to support ExxonMobil’s internal users. The chatbot used a decision matrix, along with a natural language processor to open support tickets and decide the correct support team to assign the tickets to. Currently \"Summer\" is up and running and supports over 300 users on a daily basis."
        },
        {
          "title": "Order Domain Service (ODS)",
          "description": "Worked as a Tech lead on the Order Domain Service (ODS) project. The objective of this project was to provide a one-stop shop for all ExxonMobil's sales orders information so orders could be placed/consulted either through a REST API or through an event driven architecture (Kafka MQ's)"
        },
        {
          "title": "Delivery Domain Service (DDS)",
          "description": "Worked as a Tech lead on the Delivery Domain Service (DDS) project. The objective of this project was to provide a one-stop shop for all ExxonMobil's delivery information so it could be consumed either through a REST API or through an event driven architecture (Kafka MQ's)"
        }
      ],
      "technologies": [
        "/assets/img/emblems/csharp.svg",
        "/assets/img/emblems/java.svg",
        "/assets/img/emblems/springboot.png",
        "/assets/img/emblems/html5.png",
        "/assets/img/emblems/sql-server.png",        
        "/assets/img/emblems/angular.svg",
        "/assets/img/emblems/dotnet-core.png",
        "/assets/img/emblems/nodejs.svg",
        "/assets/img/emblems/docker.png",
        "/assets/img/emblems/k8s.png",
        "/assets/img/emblems/jenkins.png",
        "/assets/img/emblems/ocp.png",
        "/assets/img/emblems/azure.png"

      ]
    },
    {
      "logoSrc": "assets/img/career/logos/gft.svg",
      "company": "GFT",
      "startDate": "2020-07-01",
      "endDate": "2021-12-01",
      "iconSrc": "assets/img/career/icons/consulting.png",
      "about": "Started in the Black Forest in Germany 1987, GFT has grown to become a trusted sector specialist for the international financial industry. It's been a pioneer of near-shore delivery since 2001 and now offer a global team spanning more than 15 countries with a Global Delivery Workforce of 6,000 people around the world.",
      "positions": [
        {
          "title": "Tech Lead",
          "startDate": "2020-07-14",
          "endDate": "2021-06-30",
          "description": "Led a team of 5 people on a project for a customer that operates on the private equity business and is currently based in Boston. Responsible not only for designing/coding but also for guiding the technical team towards the aligned technical strategy and use of coding best practices (such as SOLID, unit testing, DDD, CI/CD and a DevOps mindset). For the technologies involved, check the \"Private equity customer project\" in the projects section."
        },
        {
          "title": "Tech Lead",
          "startDate": "2021-07-01",
          "endDate": "2021-12-01",
          "description": "Led a team of 7 people on a project for a national (Brazilian) customer that operates on the credit protection services. Responsible for coding microservices, architecture design and also guiding the team towards a top-of-the-market agile software development experience. For the technologies involved, check the \"Credit protection services project\" in the projects section."
        }
      ],
      "projects": [
        {
          "title": "Private equity customer project (Anonymized due to NDA)",
          "description": "The project used an event driven architecture that heavily relied on microservices (C#/.NET core) and cloud (Azure) concepts/technologies such as serverless (azure functions), event grid, storage queues, etc..."
        },
        {
          "title": "Credit protection services project (Anonymized due to NDA)",
          "description": "The project is a customer monitoring solution to be used both, internally and externally. It uses an architecture that heavily relies on microservices (REST and OData) and AWS cloud technologies such as Lambda, CloudFront, SQS, S3, etc... The project was developed using a variety of technologies, the ones worth listing are: Java, Scala, Angular, Docker, Openshift, Jenkins and MongoDB. Quality assurance and test automation are very relevant matters for this customer, so some technologies are being applied to match their expectations: Jasmine/Karma, JUnit, RestAssured, Cucumber, Cypress."
        }
      ],
      "technologies": [
        "/assets/img/emblems/dotnet-core.png",
        "/assets/img/emblems/sql-server.png",
        "/assets/img/emblems/azure.png",
        "/assets/img/emblems/java.png",
        "/assets/img/emblems/scala.png",
        "/assets/img/emblems/springboot.png",
        "/assets/img/emblems/angular.svg",
        "/assets/img/emblems/docker.png",
        "/assets/img/emblems/jenkins.png",
        "/assets/img/emblems/ocp.png",
        "/assets/img/emblems/mongo.png"
      ]
    },
    {
      "logoSrc": "assets/img/career/logos/serasa-experian.png",
      "company": "Serasa Experian",
      "startDate": "2021-12-01",
      "endDate": null,
      "iconSrc": "assets/img/career/icons/credit-protection.png",
      "about": "Serasa was founded in 1968 as the first brazilian credit protection services company and today is Brazil's biggest Datatech with a customer portfolio of about 500K companies and 75M people. Since 2007, Serasa is part of the Experian group which is present in 44 countries and was elected, by Forbes (2018), one of the most inovative companies in the world.",
      "positions": [
        {
          "title": "Tech Lead",
          "startDate": "2021-12-01",
          "endDate": "2022-06-30",
          "description": "Led teams of approximately 9 people on very strategic projects. My main responsibilities included translating the business requirements into technical requirements, designing/coding the technical solutions and, of course, guiding the teams towards technical excelence by using of project development and agile best practices. For the technologies involved, check the projects section."
        },
        {
          "title": "Application Architect",
          "startDate": "2022-06-30",
          "endDate": null,
          "description": "Responsible for designing technical solutions, conducting PoC's, defining the technical strategy and maintaining a portifolio of over 100 applications distributed across about 10 projects and maintained by 4 separate teams. Also, since in Serasa the Application Architect is equivalent to a \"Technical IT Manager\", I'm also responsible to act as an internal consultant and manage the tech leads for each team from a functional standpoint."
        }
      ],
      "projects": [        
        {
          "title": "Monitoramento de Clientes e Fornecedores (MDCF)",
          "description": "This product is defined as a \"customers and suppliers monitoring solution\" where companies can upload their customer/supplier portfolio and monitor all credit-protection related events for that portfolio. It uses an architecture that heavily relies on microservices (Java/Springboot) and AWS cloud technologies (EKS, CloudFront, SQS, S3, etc...). The project was developed using a variety of technologies, the ones worth listing are: Java, Angular, Docker, Jenkins and DocumentDB. Since quality assurance was a very critical aspect of this project, some technologies were used for test automation: Cypress, Jasmine/Karma, JUnit, RestAssured and Cucumber."
        },
        {
          "title": "Me Avise/Me Proteja/Automonitoramento de empresas (AMDE)",
          "description": "This product is a monitoring solution that allows Serasa partners (referred as \"distributors\") to integrate their own self-monitoring solutions with Serasa via an API and receive credit-protection related events and credit reports via webhook. The project relies heavily on the best of API practices and is supported by a microservice/SOA architecture and a robust AWS infrastructure. The technical stack used is almost identical to the one listed on the \"Monitoramento de Clientes e Fornecedores (MDCF)\" project."
        },
        {
          "title": "Motor de monitoramento (MDM)",
          "description": "This is an internal project that literally translates to \"Monitoring Engine\" and is the backbone of all of Serasa's monitoring solutions. It gathers events and data from many different internal sources (main frame, legacy applications, partner databases, etc...), transforms it into a palatable/user-friendly format and distributes it (using an event-driven approach) to the end-user products. The technical stack for this project is mostly Scala/Java/Airflow, also, due to the high-volume/low-latency nature of the project, some AWS cloud services such EMR, SNS/SQS and EKS were heavily used. For quality assurance, Cypress and JUnit were used."
        },
        {
          "title": "Ascend Insights (Legacy)",
          "description": "This is a legacy product that is used to provide insights for the user about their customer portifolio through a series of credit reports available on the platform. My biggest achievement on this project was to recover the quality of the project as whole since the development team was struggling with agile and legacy code best practices. When I arrived, the code was very messy, untested and the team didn't have clarity of how to deal with a legacy application that big. When I left, the code quality improved significantly, was almost 80% tested (unit and integration tests) and the team had a concise roadmap of the next features to tackle."
        },
        {
          "title": "Other legacy aplications",
          "description": "Serasa, as any other company with more than 50 years of history, has a significantly-sized legacy portfolio. These applications/products were built in a variety of technologies (C#/VB.NET, Java, COBOL, Python, etc...), using a monolitic archteture approach. If not handled correctly, this situation can grow out of control and become a big problem. My main achievement regarding the legacy portfolio is not only managing it effectively but also significantly reducing it."
        }
      ],
      "technologies": [
        "/assets/img/emblems/aws.png",
        "/assets/img/emblems/java.png",
        "/assets/img/emblems/springboot.png",
        "/assets/img/emblems/scala.png",
        "/assets/img/emblems/airflow.png",
        "/assets/img/emblems/angular.svg",
        "/assets/img/emblems/nodejs.svg",
        "/assets/img/emblems/docker.png",
        "/assets/img/emblems/k8s.png",
        "/assets/img/emblems/ocp.png",
        "/assets/img/emblems/jenkins.png",
        "/assets/img/emblems/mongo.png",
        "/assets/img/emblems/csharp.svg"
      ]
    }
  ]
}