{
    "summary": "I'm a life long IT enthusiast, who is always looking for new challenging opportunities. After about a decade of experience as a software engineer, a couple of years as a tech lead and many projects delivered, I have, recently, decided to also dive into the fascinating worlds of software architecture, system design and IT management.",
    "position": "Application Architect | IT Manager",
    "achievements": [
        {
            "title": "Credit Monitoring Architect",
            "description": "Became the software architect responsible for the Credit Monitoring department, with over 100 applications (~10 projects) in his portfolio."
        },
        {
            "title": "Certified Google Cloud Engineer",
            "description": "In September/2021, passed the GCP Associate Cloud Engineer certification exam."
        },
        {
            "title": "FindMe Project",
            "description": "In the tech lead/SME role, remotely delivered and set up the \"FindMe\" project. Currently, FindMe is widely used across many ExxonMobil's offices such as: Curitiba (Brazil), Buenos Aires (Argentina), Houston (US), Singapore (Malaysia), Kuala Lumpur (Malaysia) and Melbourne (Australia)."
        },
        {
            "title": "Tech Support Chatbot",
            "description": "In the tech lead/SME role, delivered a chatbot to support ExxonMobil's employees on simple and automatable tasks. Currently, \"Summer\" supports over 300 users on a daily basis."
        },
        {
            "title": "SAAT Project",
            "description": "Prior to getting the undergraduation degree, delivered and set up a project for a famous country club in Curitiba (Clube Curitibano - Lucius Smythe headquarters). The “SAAT - Sistema de Acompanhamento de Atletas de Tênis“ was a platform  to track the development/performance and manage parental control of all junior tenis athletes in the club. At the end of the project, the club proactively issued an acceptance letter stating their satisfaction with the project."
        }

    ],
    "skills": [                
        {
            "name": "Agile Software development",
            "level": 7
        },
        {
            "name": "Backend development",
            "level": 8
        },
        {
            "name": "Frontend development",
            "level": 6
        },        
        {
            "name": "Test automation",
            "level": 7
        },
        {
            "name": "Management & Leadership",
            "level": 8
        },
        {
            "name": "System design",
            "level": 7
        },
        {
            "name": "DevSecOps",
            "level": 6
        },
        
        {
            "name": "Networks",
            "level": 4
        }, 
        {
            "name": "Cloud computing",
            "level": 7
        },
        {
            "name": "Containers & Orchestration",
            "level": 8
        }               
    ],
    "languages": [
        {
            "title": "Portuguese",
            "description": "Native"
        },
        {
            "title": "English",
            "description": "Advanced"
        }
    ]
}